In [43]:
import numpy as np 
import pandas as pd 
import seaborn as sns

In [44]:
df = sns.load_dataset('tips')
df.head(2)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [45]:
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [46]:
df = df.drop(columns=['size','time'])

In [47]:
df.head(2)

   total_bill   tip     sex smoker  day
0       16.99  1.01  Female     No  Sun
1       10.34  1.66    Male     No  Sun

In [48]:
df['sex'] = df['sex'].map({"Male":0, "Female": 1})
df['smoker'] = df['smoker'].map({"No":0, "Yes": 1})

In [49]:
df.head()

   total_bill   tip sex smoker  day
0       16.99  1.01   1      0  Sun
1       10.34  1.66   0      0  Sun
2       21.01  3.50   0      0  Sun
3       23.68  3.31   0      0  Sun
4       24.59  3.61   1      0  Sun

In [50]:
x = df.drop(columns=['day'])
y = df['day']

In [51]:
from sklearn.model_selection import train_test_split

In [52]:
x_train, x_test, y_train , y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [53]:
np.round(x_train.describe(),2)

       total_bill     tip
count      195.00  195.00
mean        20.22    3.09
std          8.77    1.43
min          5.75    1.00
25%         13.66    2.00
50%         17.92    3.00
75%         24.86    3.70
max         50.81   10.00

In [54]:
from sklearn.preprocessing import StandardScaler

In [55]:
sc = StandardScaler()

In [ ]:
x_train_sc = sc.fit_transform(x_train)

In [57]:
x_train_new = pd.DataFrame(x_train_sc,columns=x_train.columns)

In [58]:
np.round(x_train_new.describe(),2)

       total_bill     tip     sex  smoker
count      195.00  195.00  195.00  195.00
mean         0.00   -0.00    0.00    0.00
std          1.00    1.00    1.00    1.00
min         -1.65   -1.46   -0.73   -0.79
25%         -0.75   -0.76   -0.73   -0.79
50%         -0.26   -0.06   -0.73   -0.79
75%          0.53    0.43    1.37    1.26
max          3.50    4.85    1.37    1.26